# ElementPropLinkCircularChainError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GlobalParameterFailures..::..ElementPropLinkCircularChainError Property
BuiltInFailures..::..GlobalParameterFailures Class See Also
---
Linked properties in highlighted elements cause a circular chain of references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementPropLinkCircularChainError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementPropLinkCircularChainError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementPropLinkCircularChainError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GlobalParameterFailures Class
Autodesk.Revit.DB Namespace